:PROPERTIES:
:ID:       926134dd-d8b9-4358-a89d-e84ce92a735f
:END:
#+title: lambda表达式
#+filetags: cpp

* Footnotes
[fn:6]
#+begin_src cpp :results output :namespaces std :includes <iostream>
int main()
{
  int i{ 0 };

  auto count{ [i]() mutable {
    std::cout << ++i << '\n';
  } };

  count(); // 调用 count -> ++i；count 内部的成员变量 i = 1

  auto otherCount{ count }; // 拷贝 count；otherCount 内部的成员变量 i = 1（同 count）

  count();                  // 调用 count -> ++i；count 内部的成员变量 i = 2
  otherCount();             // 调用 otherCount -> ++i；otherCount 内部的成员变量 i = 2
  return 0;
}
#+end_src

#+RESULTS:
: 1
: 2
: 2

[fn:5]
#+begin_src cpp :results output :namespaces std :includes <iostream> <string>
auto makeWalrus(const std::string& name)
{
  // 引用捕获 name
  return [&]() {
    std::cout << "I am a walrus, my name is " << name << '\n'; // FIXME 3.
  };
}

int main()
{
  // 1. 用 "Roofus" 创建临时的 std::string ，lambda 引用捕获这个临时字符串；临时字符串 在 makeWalrus("Roofus") 调用后消亡，但是 sayName 之后又引用它，悬空引用
  auto sayName{ makeWalrus("Roofus") };

  // 2. sayName悬空引用，又进行调用
  sayName();

  return 0;
}
#+end_src

[fn:4]
#+begin_src cpp :results output :namespaces std :includes <iostream>
int main()
{
  int ammo{ 10 };

  auto shoot{
    // 引用捕获
    [&ammo]() {
      // 修改 ammo
      --ammo;

      std::cout << "Pew! " << ammo << " shot(s) left.\n";
    }
  };

  shoot();

  std::cout << ammo << " shot(s) left\n";

  return 0;
}
#+end_src


[fn:3]
#+begin_src cpp :results output :namespaces std :includes <iostream>
int main()
{
  int ammo{ 10 };

  auto shoot{
    [ammo]() mutable { // 现在是 mutable
      // 现在可以修改 ammo
      --ammo;

      std::cout << "Pew! " << ammo << " shot(s) left.\n";
    }
  };

  shoot();
  shoot();

  std::cout << ammo << " shot(s) left\n";

  return 0;
}
#+end_src

[fn:2]
#+begin_src cpp :results output :namespaces std :includes <iostream>
int main()
{
  int ammo{ 10 };

  // Define a lambda and store it in a variable called "shoot".
  auto shoot{
    [ammo]() {
      // FIXME ammo 不能修改，因为 值捕获的是常量
      --ammo;

      std::cout << "Pew! " << ammo << " shot(s) left.\n";
    }
  };

  // Call the lambda
  shoot();

  std::cout << ammo << " shot(s) left\n";

  return 0;
}
#+end_src


[fn:1]
#+begin_src cpp :results output :namespaces std :includes <iostream>
#include <algorithm>
#include <array>
#include <iostream>
#include <string_view>

int main()
{
  // Print a value and count how many times @print has been called.
  auto print{
    [](auto value) {
      static int callCount{ 0 }; // 这里是static变量，我们的print有两种 C字符串字面量、整型字面量，因此我们有两个 lambda，它们之间的计数不共享，因此造成下面的次序
      std::cout << callCount++ << ": " << value << '\n';
    }
  };

  print("hello"); // 0: hello
  print("world"); // 1: world

  print(1); // 0: 1
  print(2); // 1: 2

  print("ding dong"); // 2: ding dong

  return 0;
}
#+end_src
